SISE_AR/conf/xml-resources/web-service-references/aacia2k4/wsdl/gps.ikeasistencia.com.ar_8000/soap/aacia2k4.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:s12enc="http://www.w3.org/2003/05/soap-encoding/" xmlns:s12env="http://www.w3.org/2003/05/soap-envelope/" xmlns:senc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:senv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="tns" xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" targetNamespace="tns" name="Application"><wsdl:types><xs:schema targetNamespace="tns" elementFormDefault="qualified"><xs:import namespace="http://www.w3.org/2001/XMLSchema"/><xs:complexType name="agregar_servicio"><xs:sequence><xs:element name="nombre_origen" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="codigo_de_autorizacion" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="telefono" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="denunciante" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="cobertura" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="tipo_srv_inicial" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="desperfecto" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="ubicacion" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="localidad" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="destino" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="origengeo" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="destinogeo" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="patente" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="titular" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="modelo" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="color" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="hora_inicio" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="operador" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="observaciones" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="agregar_servicioResponse"><xs:sequence><xs:element name="agregar_servicioResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="ike_prestador"><xs:sequence><xs:element name="id_prestador" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="nombre" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="razon_social" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="titular" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="cuit" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="activo" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="pais" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="provincia" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="localidad" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="direccion" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="lat_lng" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="horario" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="email" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="telefonos" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="tipo" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="area" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="alias" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="envio_electronico" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="localidades" type="xs:string" maxOccurs="1000"/><xs:element name="servicios" type="xs:string" maxOccurs="1000"/><xs:element name="ids_localidades" type="xs:string" maxOccurs="1000"/><xs:element name="prioridades" type="xs:string" maxOccurs="1000"/></xs:sequence></xs:complexType><xs:complexType name="ike_prestadorResponse"><xs:sequence><xs:element name="ike_prestadorResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="ike_prestador_delete"><xs:sequence><xs:element name="id_prestador" type="xs:string"/></xs:sequence></xs:complexType><xs:complexType name="ike_prestador_deleteResponse"><xs:sequence><xs:element name="ike_prestador_deleteResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="ike_prestador_process"><xs:sequence/></xs:complexType><xs:complexType name="ike_prestador_processResponse"><xs:sequence><xs:element name="ike_prestador_processResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="prestadores_servicio"><xs:sequence><xs:element name="id_origen" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="id_destino" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="id_caso" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="id_servicio" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="id_subservicio" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="prestadores_servicioResponse"><xs:sequence><xs:element name="prestadores_servicioResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="say_hello"><xs:sequence><xs:element name="name" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="times" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="say_helloResponse"><xs:sequence><xs:element name="say_helloResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="agregar_servicio" type="tns:agregar_servicio"/><xs:element name="agregar_servicioResponse" type="tns:agregar_servicioResponse"/><xs:element name="ike_prestador" type="tns:ike_prestador"/><xs:element name="ike_prestadorResponse" type="tns:ike_prestadorResponse"/><xs:element name="ike_prestador_delete" type="tns:ike_prestador_delete"/><xs:element name="ike_prestador_deleteResponse" type="tns:ike_prestador_deleteResponse"/><xs:element name="ike_prestador_process" type="tns:ike_prestador_process"/><xs:element name="ike_prestador_processResponse" type="tns:ike_prestador_processResponse"/><xs:element name="prestadores_servicio" type="tns:prestadores_servicio"/><xs:element name="prestadores_servicioResponse" type="tns:prestadores_servicioResponse"/><xs:element name="say_hello" type="tns:say_hello"/><xs:element name="say_helloResponse" type="tns:say_helloResponse"/></xs:schema></wsdl:types><wsdl:message name="agregar_servicio"><wsdl:part name="agregar_servicio" element="tns:agregar_servicio"/></wsdl:message><wsdl:message name="agregar_servicioResponse"><wsdl:part name="agregar_servicioResponse" element="tns:agregar_servicioResponse"/></wsdl:message><wsdl:message name="ike_prestador"><wsdl:part name="ike_prestador" element="tns:ike_prestador"/></wsdl:message><wsdl:message name="ike_prestadorResponse"><wsdl:part name="ike_prestadorResponse" element="tns:ike_prestadorResponse"/></wsdl:message><wsdl:message name="ike_prestador_delete"><wsdl:part name="ike_prestador_delete" element="tns:ike_prestador_delete"/></wsdl:message><wsdl:message name="ike_prestador_deleteResponse"><wsdl:part name="ike_prestador_deleteResponse" element="tns:ike_prestador_deleteResponse"/></wsdl:message><wsdl:message name="ike_prestador_process"><wsdl:part name="ike_prestador_process" element="tns:ike_prestador_process"/></wsdl:message><wsdl:message name="ike_prestador_processResponse"><wsdl:part name="ike_prestador_processResponse" element="tns:ike_prestador_processResponse"/></wsdl:message><wsdl:message name="prestadores_servicio"><wsdl:part name="prestadores_servicio" element="tns:prestadores_servicio"/></wsdl:message><wsdl:message name="prestadores_servicioResponse"><wsdl:part name="prestadores_servicioResponse" element="tns:prestadores_servicioResponse"/></wsdl:message><wsdl:message name="say_hello"><wsdl:part name="say_hello" element="tns:say_hello"/></wsdl:message><wsdl:message name="say_helloResponse"><wsdl:part name="say_helloResponse" element="tns:say_helloResponse"/></wsdl:message><wsdl:portType name="Application"><wsdl:operation name="agregar_servicio" parameterOrder="agregar_servicio"><wsdl:input name="agregar_servicio" message="tns:agregar_servicio"/><wsdl:output name="agregar_servicioResponse" message="tns:agregar_servicioResponse"/></wsdl:operation><wsdl:operation name="ike_prestador" parameterOrder="ike_prestador"><wsdl:input name="ike_prestador" message="tns:ike_prestador"/><wsdl:output name="ike_prestadorResponse" message="tns:ike_prestadorResponse"/></wsdl:operation><wsdl:operation name="ike_prestador_delete" parameterOrder="ike_prestador_delete"><wsdl:input name="ike_prestador_delete" message="tns:ike_prestador_delete"/><wsdl:output name="ike_prestador_deleteResponse" message="tns:ike_prestador_deleteResponse"/></wsdl:operation><wsdl:operation name="ike_prestador_process" parameterOrder="ike_prestador_process"><wsdl:input name="ike_prestador_process" message="tns:ike_prestador_process"/><wsdl:output name="ike_prestador_processResponse" message="tns:ike_prestador_processResponse"/></wsdl:operation><wsdl:operation name="prestadores_servicio" parameterOrder="prestadores_servicio"><wsdl:input name="prestadores_servicio" message="tns:prestadores_servicio"/><wsdl:output name="prestadores_servicioResponse" message="tns:prestadores_servicioResponse"/></wsdl:operation><wsdl:operation name="say_hello" parameterOrder="say_hello"><wsdl:input name="say_hello" message="tns:say_hello"/><wsdl:output name="say_helloResponse" message="tns:say_helloResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="Application" type="tns:Application"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="agregar_servicio"><soap:operation soapAction="agregar_servicio" style="document"/><wsdl:input name="agregar_servicio"><soap:body use="literal"/></wsdl:input><wsdl:output name="agregar_servicioResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ike_prestador"><soap:operation soapAction="ike_prestador" style="document"/><wsdl:input name="ike_prestador"><soap:body use="literal"/></wsdl:input><wsdl:output name="ike_prestadorResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ike_prestador_delete"><soap:operation soapAction="ike_prestador_delete" style="document"/><wsdl:input name="ike_prestador_delete"><soap:body use="literal"/></wsdl:input><wsdl:output name="ike_prestador_deleteResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ike_prestador_process"><soap:operation soapAction="ike_prestador_process" style="document"/><wsdl:input name="ike_prestador_process"><soap:body use="literal"/></wsdl:input><wsdl:output name="ike_prestador_processResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="prestadores_servicio"><soap:operation soapAction="prestadores_servicio" style="document"/><wsdl:input name="prestadores_servicio"><soap:body use="literal"/></wsdl:input><wsdl:output name="prestadores_servicioResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="say_hello"><soap:operation soapAction="say_hello" style="document"/><wsdl:input name="say_hello"><soap:body use="literal"/></wsdl:input><wsdl:output name="say_helloResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Application"><wsdl:port name="Application" binding="tns:Application"><soap:address location="http://gps.ikeasistencia.com.ar:8000/soap/aacia2k4?wsdl"/></wsdl:port></wsdl:service></wsdl:definitions>